Revit 2024 API
FilledRegionType.IsValidSolidFillPatternId Method
 Checks if the id is valid for a background pattern
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool IsValidSolidFillPatternId(
	ElementId patternId
)
Visual Basic
Public Function IsValidSolidFillPatternId ( _
	patternId As ElementId _
) As Boolean
Visual C++
public:
bool IsValidSolidFillPatternId(
	ElementId^ patternId
)
Parameters
patternId
Type: Autodesk.Revit.DB.ElementId
 Element id of the FillPatternElement
Return Value
 False if in a family and the id is a solid fill pattern and 'isMasking' is masking is false. True otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace